#+TITLE: Dynamic Field Authorization — Repository Integration Plan
#+AUTHOR: Axum Clean
#+STARTUP: overview
#+OPTIONS: toc:2

* Step 1 — Authorization Crate Changes

Create:

#+begin_example
authorization/src/access_descriptor/
mod.rs
user_access.rs
#+end_example

---

**user_access.rs**

#+begin_src rust
use std::collections::HashSet;
use application::projection::user::UserField;

pub struct UserAccess {
pub can_read: bool,
pub allowed_fields: HashSet<UserField>,
}
#+end_src

#+RESULTS:
: error: Could not compile `cargon5qEs4`.

NOTE:

authorization depends on application TYPES only,
NOT domain entities.

This prevents circular dependency.

---

* Step 4 — Field Groups

group.rs

#+begin_src rust
pub enum UserFieldGroup {
Public,
Private,
Security,
Audit,
}
#+end_src

#+RESULTS:

Resolver:

#+begin_src rust
impl UserFieldGroup {
pub fn resolve(&self) -> &'static [UserField] {
match self {
Self::Public => &[
UserField::Id,
UserField::Username,
UserField::Status,
],
Self::Private => &[
UserField::Email,
UserField::Preferences,
],
Self::Security => &[
UserField::FailedLogins,
UserField::LockedUntil,
],
Self::Audit => &[
UserField::LastLogin,
UserField::Version,
],
}
}
}
#+end_src

#+RESULTS:
: error: Could not compile `cargoDG7X4d`.

Authorization policies reference GROUPS only.

---

